import sys
input = sys.stdin.readline

N = int(input())
if N%2 == 1:
    print(0)
    exit()

dp = [0]*(N+1)
dp[0] = 1
dp[2] = 3

for i in range(4, N+1, 2):
    dp[i] = dp[i-2]*3
    for k in range(0, i-2, 2):
        dp[i] += dp[k]*2

print(dp[N])


'''
N이 홀수면 무조건 0
2 : 3(---,-||,||-) = 3
4 : 3*3(2모양 반복), 2가지 = 11
6 : 3*3*3(2모양 반복), 2*3 *2 (4모양*2모양), 2가지 = 41
8 : 3**4, 2*3*3 *3 (4,2,2), 2*2 (4,4), 2*3*2 (2,6), 2가지 = 153

4 : dp[2] *3 +2 = 11
6 : dp[4] *3 +dp[2]*2 + 2 = 33+6+2 = 41
8 : dp[6] *3 + dp[4]*2 + dp[2]*2 + 2 = 123+22+6+2 = 153
'''